package com.admin.server;

/**
 * 文件名称： com.admin.server.Server.java</br>
 * 初始作者： ZhouLanHui</br>
 * 创建日期： 2017年11月12日</br>
 * 功能说明： 这里用一句话描述这个类的作用--此句话需删除 <br/>
 *
 * =================================================<br/>
 * 修改记录：<br/>
 * 修改作者        日期       修改内容<br/>
 *
 *
 * ================================================<br/>
 *  Copyright (c) 2010-2011 .All rights reserved.<br/>
 */
public interface Server {
	/**
	 *
	 *
	 * 方法描述: [这里用一句话描述这个方法的作用.]</br>
	 * 初始作者: ZhouLanHui<br/>
	 * 创建日期: 2017年11月12日-下午2:18:26<br/>
	 * 开始版本: 2.0.0<br/>
	 * =================================================<br/>
	 * 修改记录：<br/>
	 * 修改作者         日期         修改内容<br/>
	 * ================================================<br/>
	 * void
	 *
	 */
	void start();
	/**
	 *
	 *
	 * 方法描述: [这里用一句话描述这个方法的作用.]</br>
	 * 初始作者: ZhouLanHui<br/>
	 * 创建日期: 2017年11月12日-下午2:18:30<br/>
	 * 开始版本: 2.0.0<br/>
	 * =================================================<br/>
	 * 修改记录：<br/>
	 * 修改作者         日期         修改内容<br/>
	 * ================================================<br/>
	 * void
	 *
	 */
	void restart();
	/**
	 *
	 *
	 * 方法描述: [这里用一句话描述这个方法的作用.]</br>
	 * 初始作者: ZhouLanHui<br/>
	 * 创建日期: 2017年11月12日-下午2:18:34<br/>
	 * 开始版本: 2.0.0<br/>
	 * =================================================<br/>
	 * 修改记录：<br/>
	 * 修改作者         日期         修改内容<br/>
	 * ================================================<br/>
	 * void
	 *
	 */
	void shutdown();

}
